; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	infrared0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star0 - direction
	Star2 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star6)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 Star15)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 image2)
	(have_image Planet12 image2)
	(have_image Phenomenon13 infrared0)
	(have_image Planet14 image2)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 image2)
	(have_image Planet17 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
2. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 10
3. (turn_to satellite0 star9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star9)
   goals met: 0 of 10
4. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 10
5. (turn_to satellite0 groundstation8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation8)
   goals met: 1 of 10
6. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 10
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 10
8. (calibrate satellite0 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 1 of 10
9. (turn_to satellite0 planet12 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet12)
   goals met: 1 of 10
10. (take_image satellite0 planet12 instrument2 image2)
   added: (have_image planet12 image2)
   goals met: 2 of 10
11. (turn_to satellite0 phenomenon16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 10
12. (take_image satellite0 phenomenon16 instrument2 image2)
   added: (have_image phenomenon16 image2)
   goals met: 3 of 10
13. (turn_to satellite0 phenomenon11 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 10
14. (take_image satellite0 phenomenon11 instrument2 image2)
   added: (have_image phenomenon11 image2)
   goals met: 4 of 10
15. (turn_to satellite0 planet14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet14)
   goals met: 4 of 10
16. (take_image satellite0 planet14 instrument2 image2)
   added: (have_image planet14 image2)
   goals met: 5 of 10
17. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 10
18. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 10
19. (turn_to satellite0 groundstation8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation8)
   goals met: 5 of 10
20. (calibrate satellite0 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 5 of 10
21. (turn_to satellite0 phenomenon10 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 10
22. (take_image satellite0 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 10
23. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 6 of 10
24. (take_image satellite0 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 7 of 10
25. (turn_to satellite0 planet17 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet17)
   goals met: 7 of 10
26. (take_image satellite0 planet17 instrument1 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 8 of 10
27. (turn_to satellite0 star15 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star15)
   goals met: 9 of 10
28. (take_image satellite0 star15 instrument1 infrared0)
   added: (have_image star15 infrared0)
   goals met: 10 of 10
